x <- 1.5
x

numeric(10) # 长度为10的全0向量

# 函数c()实现将多个对象combine成一个向量
c(1, 2, 3, 4, 5)
c(1, 2, c(3, 4, 5))

## 创建等差向量
1:5
seq(1, 10, 2)
seq(3, length.out = 10)

## 创建重复的数值向量
x <- 1:3
rep(x, 2)
rep(x, each = 2)
rep(x, c(2, 1, 2))
rep(x, each = 2, length.out = 4)
rep(x, times = 3, each = 2)

# 逻辑向量
c(1, 2) > c(2, 1) # 等价于 c(1>2, 2>1)
c(2, 3) > c(1, 2, -1, 3)

# 元素属于运算符%in%:判断元素是否属于集合
c(1, 4) %in% c(1, 2, 3)

# 字符向量
"hello, world!"

c("Hello", "World")
c("Hello", "World") == "Hello, world"

# 访问向量子集
## 使用元素的位置来访问
v1 <- c(1, 2, 3, 4)
v1[2]
v1[2:4]
v1[-3]
v1[c(1, 3)]

## 可以在创建向量的同时对其每个元素命名
x <- c(a = 1, b = 2, c = 3)
x
## 命名后，就可以通过名字来访问向量元素
x[c("a", "c")]
x["d"]
## 访问向量名字
names(x)
## 修改向量名字
names(x) <- c("x", "y", "z")
names(x)

## []是提取对象的子集，[[]]是提取对象内的元素
### 二者的区别:将一个向量比作10盒糖果,你可以使用[1]取1盒糖果，使用[[1]]打开盒子并从中取出一颗糖果。
x <- c(a = 1, b = 2, c = 3)
x["a"]

x[["a"]]

## 对向量排序
x <- c(1, 5, 8, 2, 9, 7, 4)
sort(x)
order(x)

x[order(x)]

rank(x)
rev(x)
## 多维数组想象成书的概念